Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/moving_country/moving_abroad/leaving_ireland/leaving_ireland_and_your_social_security_entitlements.html.txt.tmx
Source language: en
Languages: pl

source: Leaving Ireland and your social security entitlements
pl: Wyjazd z Irlandii a uprawnienia do otrzymywania świadczeń socjalnych

source: • Countries covered by EU Regulations
pl: • Kraje objęte regulacjami UE

source: Every year, thousands of citizens leave Ireland to work, travel, study or retire abroad
pl: Co roku tysiące mieszkańców Irlandii wyjeżdża z kraju, aby podróżować, pracować lub studiować za granicą

source: Some people leave Ireland to work or study for a short period (that is, a few months), other people go abroad for longer
pl: Niektórzy wyjeżdżają na krótko (tj. na kilka miesięcy), do pracy lub do szkoły, inni zostają za granicą przez dłuższy czas

source: Many others who have been living, studying or working in Ireland also leave to return to their home countries
pl: Natomiast osoby, które mieszkały, studiowały lub pracowały w Irlandii, wracają do swojego kraju

source: If you leave Ireland to live and/or work in another country, you may be entitled to receive social security benefits in the country you are moving to
pl: Dlatego ważna jest świadomość, że osoby, które wyjechały z Irlandii z zamiarem zamieszkania i/lub rozpoczęcia pracy w innym kraju, mogą być uprawnione do otrzymywania świadczeń socjalnych w kraju, do którego się przenoszą

source: You can find information about it in our document on social security arrangements that Ireland has with other countries
pl: Zawarte pomiędzy Irlandią a innymi krajami porozumienia dotyczące świadczeń socjalnych można podzielić

source: Countries covered by EU Regulations
pl: Kraje objęte regulacjami UE

source: If you move to live or work in a country covered by EU Regulations, this means that for social security benefits or services, you are entitled to be treated in the same way as the nationals in the EU member state or EEA country that you move to
pl: Osoby zamierzające zamieszkać lub podjąć pracę w kraju objętym regulacjami UE są uprawnione do takich samych świadczeń socjalnych, co obywatele danego Państwa Członkowskiego UE/kraju EOG

source: On a practical level, this means that you and your family are entitled to apply for any benefits or assistance available in the country in which you reside
pl: Oznacza to, że dana osoba i jej rodzina jest uprawniona do ubiegania się o wszelkie zasiłki i pomoc dostępne w danym kraju

source: If you are applying for insurance-based payments, any contributions made in other EU member states or EEA countries should be taken into account
pl: W razie ubiegania się o wypłaty z tytułu ubezpieczenia, pod uwagę brane są wszelkie składki wniesione w innych Państwach Członkowskich UE/krajach EOG

source: Social insurance contribution record
pl: Dokumentacja składek na ubezpieczenie społeczne

source: If you need to claim benefits while living abroad you will be asked to provide information about your Irish social insurance record
pl: Osoba zmieniająca miejsce zamieszkania w granicach UE/EOG może otrzymać formularze E104 i U1 (poprzednio E301) – zob. „Jak składać podanie” poniżej

source: You can use forms E104 and U1 (formerly E301) when claiming sickness, maternity or unemployment benefits abroad - see 'How to apply' below
pl: Formularze U1 określa się mianemdokumentów przenośnych

source: The U1 is called a portable document and it provides details of your Irish social insurance record
pl: Dokumenty te zawierają szczegółowe informacje na temat dokumentacji ubezpieczenia społecznego na terenie Irlandii

source: If you don’t bring your E104 or U1 with you, the country you have moved to will contact Irish authorities to get a record of your insurance contributions when you apply to them for unemployment, sickness or maternity benefits
pl: Jeśli zainteresowana osoba nie przywiezie ze sobą formularza E104 lub U1, kraj, do którego się przeprowadziła skontaktuje się z odpowiednimi organami w Irlandii i uzyska dokumentację składek na ubezpieczenie społeczne takiej osoby w przypadku, gdy ubiega się ona o zasiłek dla bezrobotnych, chorobowy lub macierzyński

source: A request from another EU member state for your social insurance record will be prioritised by the Department of Social Protection so that you don’t lose out on any benefits due to you when abroad
pl: Wniosek złożony przez inne państwo członkowskie UE dotyczący dokumentacji ubezpieczenia społecznego będzie załatwiany priorytetowo przez Departament Ochrony Socjalnej (DSP), tak aby zainteresowana osoba nie straciła żadnego z przysługujących jej świadczeń podczas pobytu za granicą

source: If you are returning to Ireland from a country in the EU or EEA, you should bring an E104 and U1 form back with you as they will provide details of the insurance contributions you made in that country
pl: Osoba wracająca do Irlandii z kraju należącego do UE/EOG powinna zabrać ze sobą formularze E104 i U1, ponieważ dostarczą one informacji na temat składek na ubezpieczenie zapłaconych w tamtym kraju

source: The forms are presented at the relevant social security agency of the country you are living in when you are making a claim
pl: Formularze te należy przedstawić w odpowiednim zakładzie ubezpieczenia społecznego w kraju zamieszkiwanym w chwili ubiegania się o świadczenie

source: A request for an E104 or U1 by another EU member state is always prioritised by the Department of Social Protection
pl: Wniosek o wydanie formularza E104 lub U1 złożony przez inne państwo członkowskie UE zawsze załatwiany jest przez Departament Ochrony Socjalnej (DSP) priorytetowo

source: This is because a person who is unemployed or sick abroad has made a claim for benefit and it must be dealt with as quickly as possible
pl: Dzieje się tak dlatego, że osoba, która za granicą jest bezrobotna lub chora złożyła wniosek o przyznanie świadczenia i musi on być rozpatrzony jak najszybciej

source: If you want to bring your E104 and U1 with you, you can request your Irish social insurance record for E104 and U1 (pdf) before leaving
pl: Osoba, która chce zabrać ze sobą formularz E104 i U1 może złożyć wniosek o przedstawienie dokumentacji ubezpieczenia społecznego na terenie Irlandii na formularzu E104 i U1/E301 (pdf)

source: Processing your application can take some time as the DSP may have to contact your recent employer/s before the E104 and U1 forms can be issued
pl: Załatwianie wniosku może trochę potrwać, ponieważ DSP może być zmuszony do skontaktowania się z ostatnim pracodawcą lub pracodawcami wnioskodawcy przed wydaniem formularzy E104 i U1

source: You should send the completed application form to the International Records Section of the Department of Social Protection - see 'Where to apply' below
pl: Wypełniony formularz wniosku należy przesłać do Działu Danych Międzynarodowych Departamentu Ochrony Socjalnej (DSP) poniżej należy zapoznać się z sekcją “Gdzie się ubiegać”

source: With your application, you must include a copy of your P45, a copy of your P60 and remember to include your address abroad
pl: Do wniosku należy dołączyć kopię formularza P45 i kopię formularza P60; należy pamiętać o podaniu adresu za granicą, pod którym zainteresowana osoba będzie przebywać po wyjeździe z Irlandii
